/*--------------------------------------------------------------------
/* File name   : STC8Ax_DELAY.h
/* Author      : nbufe
/* Copyright(C): 2021-2022 nbufe. All rights reserved.
/*--------------------------------------------------------------------
 */
#ifndef __STC8Ax_DELAY_H_
#define __STC8Ax_DELAY_H_

/* 包含头文件 -------------------------------------------------------*/
#include "STC8Ax_REG.h"
//#include "STC8Ax_CONF.h"
//#include "STC8Ax_SYSCLK.h"

/* 类型定义 ---------------------------------------------------------*/
/* None. */
/* 宏定义 -----------------------------------------------------------*/
/* None. */
/* 扩展变量 ---------------------------------------------------------*/
/* None. */
/* 函数声明 ---------------------------------------------------------*/
//void Delay_Init(void);
//void Delay_us(uint16_t nus);
void Delay_ms(uint16_t nms);

#endif /* __STC8Ax_DELAY_H_ */

/*>>>>>>>>>> (C) COPYRIGHT NBUFE <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
