/*--------------------------------------------------------------------
/* File name   : LCD1602.h
/* Author      : PSYM
/* Copyright(C): 2023 PSYM. All rights reserved.
/*--------------------------------------------------------------------
 */
#ifndef __LCD1602_H_
#define __LCD1602_H_

/* 包含头文件 -------------------------------------------------------*/
#include "STC8Ax_REG.h"
#include "STC8Ax_DELAY.h"

/* 类型定义 ---------------------------------------------------------*/
sbit RS = P1 ^ 7;
sbit RW = P1 ^ 6;
sbit EN = P1 ^ 5;

/* 宏定义 -----------------------------------------------------------*/
#define DB P2

/* 扩展变量 ---------------------------------------------------------*/
/* None. */

/* 函数声明 ---------------------------------------------------------*/
void LCD1602_Init();
void LCD1602_Clear();
void LCD_roll(uint8 flag);
void LCD1602_ShowString(uint8 x, uint8 y, uint8 *str);

#endif /* __LCD1602_H_ */

/*>>>>>>>>>> (C) COPYRIGHT PSYM <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
