/*-------------------------------------------------------------------
/*      (C) Copyright 2021-2022, nbufe. All Rights Reserved 
/*-------------------------------------------------------------------
/* File name   : STC8Ax_GPIO.c
/* Description : STC8Ax GPIO函数库
/* Author      : nbufe
/* Update date : 2021.12.15 
/*-------------------------------------------------------------------
/* Update note:
/* ---------   -----------   ----------------------------------------
/*   Date        Author                       Note
/* ---------   -----------   ----------------------------------------
/*  
/*
**/

/* 包含头文件 -------------------------------------------------------*/
#include "STC8Ax_GPIO.h"

/* 私有类型定义 -----------------------------------------------------*/
/* None. */

/* 私有宏定义 -------------------------------------------------------*/
/* None. */

/* 私有变量 ---------------------------------------------------------*/
/* None. */

/* 扩展变量 ---------------------------------------------------------*/
/* None. */

/* 私有函数原形 -----------------------------------------------------*/
/* None. */

/* 函数体 -----------------------------------------------------------*/
/*
 * 功能: GPIO    端口初始化
 * 参数: gpio:   GPIO端口, GPIO_P0 - GPIO_P7
 *       pin:    I/O引脚,  GPIO_Pin_0 - GPIO_Pin_7 IO引脚 Px.0-7
 *                         GPIO_Pin_LNIB IO引脚低 4 位
 *                         GPIO_Pin_HNIB IO引脚高 4 位
 *                         GPIO_Pin_All  IO所有引脚
 *       mode: 	 工作模式
 * 返回：SUCCESS 返回成功。
 * 			 ERROR   返回失败。
 */
//#define chr(x)	#@x
//ErrorStatus GPIO_Initl(uint8_t gpio_x, uint8_t pin, eGPIO_Mode mode)
//{
//		if(gpio_x > GPIO_P7)	return ERROR;
//			
//		if(mode & BIT0)	Px_M0(gpio_x) |= (pin);
//		else	Px_M0(gpio_x) &= ~(pin);
//		
//		if(mode & BIT1)	Px_M1(gpio_x) |= (pin);
//		else	Px_M1(gpio_x) &= ~(pin);

//		return SUCCESS;
//}


/*>>>>>>>>>> (C) COPYRIGHT NBUFE <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
